USE z_MyBase_2;
GO

CREATE DATABASE UNIVER;
GO

USE UNIVER;
GO 

if object_id(N'PROGRESS', N'U') is not null drop table PROGRESS;
if object_id(N'STUDENT', N'U') is not null drop table STUDENT;
if object_id(N'GROUPS', N'U') is not null drop table GROUPS;
if object_id(N'SUBJECT', N'U') is not null drop table SUBJECT;
if object_id(N'TEACHER', N'U') is not null drop table TEACHER;
if object_id(N'AUDITORIUM', N'U') is not null drop table AUDITORIUM;
if object_id(N'PULPIT', N'U') is not null drop table PULPIT;
if object_id(N'PROFESSION', N'U') is not null drop table PROFESSION;
if object_id(N'FACULTY', N'U') is not null drop table FACULTY;
if object_id(N'AUDITORIUM_TYPE', N'U') is not null drop table AUDITORIUM_TYPE;

create table AUDITORIUM_TYPE 
(    
    AUDITORIUM_TYPE nchar(10) constraint AUDITORIUM_TYPE_PK primary key,  
    AUDITORIUM_TYPENAME nvarchar(30)       
);

insert into AUDITORIUM_TYPE (AUDITORIUM_TYPE, AUDITORIUM_TYPENAME) values 
    (N'ЛК', N'Лекционная'),
    (N'ЛБ-К', N'Компьютерный класс'),
    (N'ЛК-К', N'Лекционная с уст. проектором'),
    (N'ЛБ-X', N'Химическая лаборатория'),
    (N'ЛБ-СК', N'Спец. компьютерный класс');

create table AUDITORIUM 
(   
    AUDITORIUM nchar(20) constraint AUDITORIUM_PK primary key,              
    AUDITORIUM_TYPE nchar(10) constraint AUDITORIUM_AUDITORIUM_TYPE_FK foreign key         
        references AUDITORIUM_TYPE(AUDITORIUM_TYPE), 
    AUDITORIUM_CAPACITY integer constraint AUDITORIUM_CAPACITY_CHECK default 1 check (AUDITORIUM_CAPACITY between 1 and 300),
    AUDITORIUM_NAME nvarchar(50)                                     
);

insert into AUDITORIUM (AUDITORIUM, AUDITORIUM_NAME, AUDITORIUM_TYPE, AUDITORIUM_CAPACITY) values 
    (N'206-1', N'206-1', N'ЛБ-К', 15),
    (N'301-1', N'301-1', N'ЛБ-К', 15),
    (N'236-1', N'236-1', N'ЛК', 60),
    (N'313-1', N'313-1', N'ЛК-К', 60),
    (N'324-1', N'324-1', N'ЛК-К', 50),
    (N'413-1', N'413-1', N'ЛБ-К', 15),
    (N'423-1', N'423-1', N'ЛБ-К', 90),
    (N'408-2', N'408-2', N'ЛК', 90);

create table FACULTY
(    
    FACULTY nchar(10) constraint FACULTY_PK primary key,
    FACULTY_NAME nvarchar(50) default N'???'
);

insert into FACULTY (FACULTY, FACULTY_NAME) values 
    (N'ХТиТ', N'Химическая технология и техника'),
    (N'ЛХФ', N'Лесохозяйственный факультет'),
    (N'ИЭФ', N'Инженерно-экономический факультет'),
    (N'ТТЛП', N'Технология и техника лесной промышленности'),
    (N'ТОВ', N'Технология органических веществ'),
    (N'ИТ', N'Факультет информационных технологий'),
    (N'ИДиП', N'Издательское дело и полиграфия');

create table PROFESSION
(   
    PROFESSION nchar(20) constraint PROFESSION_PK primary key,
    FACULTY nchar(10) constraint PROFESSION_FACULTY_FK foreign key 
        references FACULTY(FACULTY),
    PROFESSION_NAME nvarchar(100),
    QUALIFICATION nvarchar(50)  
);  

insert into PROFESSION (FACULTY, PROFESSION, PROFESSION_NAME, QUALIFICATION) values 
    (N'ИТ', N'1-40 01 02', N'Информационные системы и технологии', N'инженер-программист-системотехник'),
    (N'ИТ', N'1-47 01 01', N'Издательское дело', N'редактор-технолог'),
    (N'ИТ', N'1-36 06 01', N'Полиграфическое оборудование и системы обработки информации', N'инженер-электромеханик'),
    (N'ХТиТ', N'1-36 01 08', N'Конструирование и производство изделий из композиционных материалов', N'инженер-механик'),
    (N'ХТиТ', N'1-36 07 01', N'Машины и аппараты химических производств и предприятий строительных материалов', N'инженер-механик'),
    (N'ЛХФ', N'1-75 01 01', N'Лесное хозяйство', N'инженер лесного хозяйства'),
    (N'ЛХФ', N'1-75 02 01', N'Садово-парковое строительство', N'инженер садово-паркового строительства'),
    (N'ЛХФ', N'1-89 02 02', N'Туризм и природопользование', N'специалист в сфере туризма'),
    (N'ИЭФ', N'1-25 01 07', N'Экономика и управление на предприятии', N'экономист-менеджер'),
    (N'ИЭФ', N'1-25 01 08', N'Бухгалтерский учет, анализ и аудит', N'экономист'),
    (N'ТТЛП', N'1-36 05 01', N'Машины и оборудование лесного комплекса', N'инженер-механик'),
    (N'ТТЛП', N'1-46 01 01', N'Лесоинженерное дело', N'инженер-технолог'),
    (N'ТОВ', N'1-48 01 02', N'Химическая технология органических веществ, материалов и изделий', N'инженер-химик-технолог'),
    (N'ТОВ', N'1-48 01 05', N'Химическая технология переработки древесины', N'инженер-химик-технолог'),
    (N'ТОВ', N'1-54 01 03', N'Физико-химические методы и приборы контроля качества продукции', N'инженер по сертификации');

create table PULPIT 
(   
    PULPIT nchar(20) constraint PULPIT_PK primary key,
    PULPIT_NAME nvarchar(100), 
    FACULTY nchar(10) constraint PULPIT_FACULTY_FK foreign key 
        references FACULTY(FACULTY) 
);  

insert into PULPIT (PULPIT, PULPIT_NAME, FACULTY) values 
    (N'ИСиТ', N'Информационных систем и технологий', N'ИТ'),
    (N'ЛВ', N'Лесоводства', N'ЛХФ'),
    (N'ЛУ', N'Лесоустройства', N'ЛХФ'),
    (N'ЛЗиДВ', N'Лесозащиты и древесиноведения', N'ЛХФ'),
    (N'ЛКиП', N'Лесных культур и почвоведения', N'ЛХФ'),
    (N'ТиП', N'Туризма и природопользования', N'ЛХФ'),
    (N'ЛПиСПС', N'Ландшафтного проектирования и садово-паркового строительства', N'ЛХФ'),
    (N'ТЛ', N'Транспорта леса', N'ТТЛП'),
    (N'ЛМиЛЗ', N'Лесных машин и технологии лесозаготовок', N'ТТЛП'),
    (N'ТДП', N'Технологий деревообрабатывающих производств', N'ТТЛП'),
    (N'ТиДИД', N'Технологии и дизайна изделий из древесины', N'ТТЛП'),
    (N'ОХ', N'Органической химии', N'ТОВ'),
    (N'ХПД', N'Химической переработки древесины', N'ТОВ'),
    (N'ТНВиОХТ', N'Технологии неорганических веществ и общей химической технологии', N'ХТиТ'),
    (N'ПиАХП', N'Процессов и аппаратов химических производств', N'ХТиТ'),
    (N'ЭТиМ', N'Экономической теории и маркетинга', N'ИЭФ'),
    (N'МиЭП', N'Менеджмента и экономики природопользования', N'ИЭФ'),
    (N'СБУАиА', N'Статистики, бухгалтерского учета, анализа и аудита', N'ИЭФ'),
    (N'ИВД', N'Информационных технологий в деревообработке', N'ТТЛП'),
    (N'ПОиСОИ', N'Полиграфического оборудования и систем обработки информации', N'ИДиП'),
    (N'ТНХСиППМ', N'Технологии нефтехимического синтеза и переработки полимерных материалов', N'ТОВ'),
    (N'ХТЭПиМЭЕ', N'Химии, технологии электрохимических производств и материалов электронной техники', N'ХТиТ'),
    (N'ОВ', N'Органической химии', N'ТОВ');

create table TEACHER
(   
    TEACHER nchar(10) constraint TEACHER_PK primary key,
    TEACHER_NAME nvarchar(100), 
    GENDER nchar(1) check (GENDER in (N'м', N'ж')),
    PULPIT nchar(20) constraint TEACHER_PULPIT_FK foreign key 
        references PULPIT(PULPIT) 
);

insert into TEACHER (TEACHER, TEACHER_NAME, GENDER, PULPIT) values 
    (N'СМЛВ', N'Смелов Владимир Владиславович', N'м', N'ИСиТ'),
    (N'ДТК', N'Дятко Александр Аркадьевич', N'м', N'ИВД'),
    (N'УРБ', N'Урбанович Павел Павлович', N'м', N'ИСиТ'),
    (N'ГРН', N'Гурин Николай Иванович', N'м', N'ИСиТ'),
    (N'ЖЛК', N'Жиляк Надежда Александровна', N'ж', N'ИСиТ'),
    (N'МРЗ', N'Мороз Елена Станиславовна', N'ж', N'ИСиТ'),
    (N'БРТШВЧ', N'Барташевич Святослав Александрович', N'м', N'ПОиСОИ'),
    (N'АРС', N'Арсентьев Виталий Арсентьевич', N'м', N'ПОиСОИ'),
    (N'НВРВ', N'Неверов Александр Васильевич', N'м', N'МиЭП'),
    (N'РВКЧ', N'Ровкач Андрей Иванович', N'м', N'ЛВ'),
    (N'ДМДК', N'Демидко Марина Николаевна', N'ж', N'ЛПиСПС'),
    (N'БРГ', N'Бурганская Татьяна Минаевна', N'ж', N'ЛПиСПС'),
    (N'РЖК', N'Рожков Леонид Николаевич', N'м', N'ЛВ'),
    (N'ЗВГЦВ', N'Звягинцев Вячеслав Борисович', N'м', N'ЛЗиДВ'),
    (N'БЗБРДВ', N'Безбородов Владимир Степанович', N'м', N'ОХ'),
    (N'НСКВЦ', N'Насковец Михаил Трофимович', N'м', N'ТЛ');

create table SUBJECT
(    
    SUBJECT nchar(10) constraint SUBJECT_PK primary key, 
    SUBJECT_NAME nvarchar(100) unique,
    PULPIT nchar(20) constraint SUBJECT_PULPIT_FK foreign key 
        references PULPIT(PULPIT)   
);

insert into SUBJECT (SUBJECT, SUBJECT_NAME, PULPIT) values 
    (N'СУБД', N'Системы управления базами данных', N'ИСиТ'),
    (N'БД', N'Базы данных', N'ИСиТ'),
    (N'ИНФ', N'Информационные технологии', N'ИСиТ'),
    (N'ОАиП', N'Основы алгоритмизации и программирования', N'ИСиТ'),
    (N'ПЗ', N'Представление знаний в компьютерных системах', N'ИСиТ'),
    (N'ПСП', N'Программирование сетевых приложений', N'ИСиТ'),
    (N'МСОИ', N'Моделирование систем обработки информации', N'ИСиТ'),
    (N'ПИС', N'Проектирование информационных систем', N'ИСиТ'),
    (N'КГ', N'Компьютерная геометрия', N'ИСиТ'),
    (N'ПМАПЛ', N'Полиграф. машины, автоматы и поточные линии', N'ПОиСОИ'),
    (N'КМС', N'Компьютерные мультимедийные системы', N'ИСиТ'),
    (N'ОПП', N'Организация полиграф. производства', N'ПОиСОИ'),
    (N'ДМ', N'Дискретная математика', N'ИСиТ'),
    (N'МП', N'Математическое программирование', N'ИСиТ'),
    (N'ЛЭВМ', N'Логические основы ЭВМ', N'ИСиТ'),
    (N'ООП', N'Объектно-ориентированное программирование', N'ИСиТ'),
    (N'ЭП', N'Экономика природопользования', N'МиЭП'),
    (N'ЭТ', N'Экономическая теория', N'ЭТиМ'),
    (N'БЛЗиПсOO', N'Биология лесных зверей и птиц с осн. охотов.', N'ЛВ'),
    (N'ОСПиЛПХ', N'Основы садово-паркового и лесопаркового хозяйства', N'ЛПиСПС'),
    (N'ИГ', N'Инженерная геодезия', N'ЛУ'),
    (N'ЛВ', N'Лесоводство', N'ЛЗиДВ'),
    (N'ОХ', N'Органическая химия', N'ОХ'),
    (N'ТРИ', N'Технология резиновых изделий', N'ТНХСиППМ'),
    (N'ВТЛ', N'Водный транспорт леса', N'ТЛ'),
    (N'ТиОЛ', N'Технология и оборудование лесозаготовок', N'ЛМиЛЗ'),
    (N'ТОПИ', N'Технология обогащения полезных ископаемых', N'ТНВиОХТ'),
    (N'ПЭХ', N'Прикладная электрохимия', N'ХТЭПиМЭЕ');

create table GROUPS 
(   
    IDGROUP integer identity(1,1) constraint GROUP_PK primary key,              
    FACULTY nchar(10) constraint GROUPS_FACULTY_FK foreign key 
        references FACULTY(FACULTY), 
    PROFESSION nchar(20) constraint GROUPS_PROFESSION_FK foreign key 
        references PROFESSION(PROFESSION),
    YEAR_FIRST smallint check (YEAR_FIRST <= YEAR(GETDATE()))                  
);

insert into GROUPS (FACULTY, PROFESSION, YEAR_FIRST) values 
    (N'ИДиП', N'1-40 01 02', 2013),
    (N'ИДиП', N'1-40 01 02', 2012),
    (N'ИДиП', N'1-40 01 02', 2011),
    (N'ИДиП', N'1-40 01 02', 2010),
    (N'ИДиП', N'1-47 01 01', 2013),
    (N'ИДиП', N'1-47 01 01', 2012),
    (N'ИДиП', N'1-47 01 01', 2011),
    (N'ИДиП', N'1-36 06 01', 2010),
    (N'ИДиП', N'1-36 06 01', 2013),
    (N'ИДиП', N'1-36 06 01', 2012),
    (N'ИДиП', N'1-36 06 01', 2011),
    (N'ХТиТ', N'1-36 01 08', 2013),
    (N'ХТиТ', N'1-36 01 08', 2012),
    (N'ХТиТ', N'1-36 07 01', 2011),
    (N'ХТиТ', N'1-36 07 01', 2010),
    (N'ТОВ', N'1-48 01 02', 2012),
    (N'ТОВ', N'1-48 01 02', 2011),
    (N'ТОВ', N'1-48 01 05', 2013),
    (N'ТОВ', N'1-54 01 03', 2012),
    (N'ЛХФ', N'1-75 01 01', 2013),
    (N'ЛХФ', N'1-75 02 01', 2012),
    (N'ЛХФ', N'1-75 02 01', 2011),
    (N'ЛХФ', N'1-89 02 02', 2012),
    (N'ЛХФ', N'1-89 02 02', 2011),
    (N'ТТЛП', N'1-36 05 01', 2013),
    (N'ТТЛП', N'1-36 05 01', 2012),
    (N'ТТЛП', N'1-46 01 01', 2012),
    (N'ИЭФ', N'1-25 01 07', 2013),
    (N'ИЭФ', N'1-25 01 07', 2012),
    (N'ИЭФ', N'1-25 01 07', 2010),
    (N'ИЭФ', N'1-25 01 08', 2013),
    (N'ИЭФ', N'1-25 01 08', 2012);

create table STUDENT 
(    
    IDSTUDENT integer identity(1000,1) constraint STUDENT_PK primary key,
    IDGROUP integer constraint STUDENT_GROUP_FK foreign key 
        references GROUPS(IDGROUP),        
    NAME nvarchar(100), 
    BDAY date,
    STAMP timestamp,
    INFO xml,
    FOTO varbinary(max)
);

insert into STUDENT (IDGROUP, NAME, BDAY) values 
    (2, N'Силюк Валерия Ивановна', '1994-07-12'),
    (2, N'Сергель Виолетта Николаевна', '1994-03-06'),
    (2, N'Добродей Ольга Анатольевна', '1994-11-09'),
    (2, N'Подоляк Мария Сергеевна', '1994-10-04'),
    (2, N'Никитенко Екатерина Дмитриевна', '1994-01-08'),
    (3, N'Яцкевич Галина Иосифовна', '1993-08-02'),
    (3, N'Осадчая Эла Васильевна', '1993-12-07'),
    (3, N'Акулова Елена Геннадьевна', '1993-12-02'),
    (4, N'Плешкун Милана Анатольевна', '1992-03-08'),
    (4, N'Буянова Мария Александровна', '1992-06-02'),
    (4, N'Харченко Елена Геннадьевна', '1992-12-11'),
    (4, N'Крученок Евгений Александрович', '1992-05-11'),
    (4, N'Бороховский Виталий Петрович', '1992-11-09'),
    (4, N'Мацкевич Надежда Валерьевна', '1992-11-01'),
    (5, N'Логинова Мария Вячеславовна', '1995-07-08'),
    (5, N'Белько Наталья Николаевна', '1995-11-02'),
    (5, N'Селило Екатерина Геннадьевна', '1995-05-07'),
    (5, N'Дрозд Анастасия Андреевна', '1995-08-04'),
    (6, N'Козловская Елена Евгеньевна', '1994-11-08'),
    (6, N'Потапнин Кирилл Олегович', '1994-03-02'),
    (6, N'Равковская Ольга Николаевна', '1994-06-04'),
    (6, N'Ходоронок Александра Вадимовна', '1994-11-09'),
    (6, N'Рамук Владислав Юрьевич', '1994-07-04'),
    (7, N'Неруганенок Мария Владимировна', '1993-01-03'),
    (7, N'Цыганок Анна Петровна', '1993-09-12'),
    (7, N'Масилевич Оксана Игоревна', '1993-06-12'),
    (7, N'Алексиевич Елизавета Викторовна', '1993-02-09'),
    (7, N'Ватолин Максим Андреевич', '1993-07-04'),
    (8, N'Синица Валерия Андреевна', '1992-01-08'),
    (8, N'Кудряшова Алина Николаевна', '1992-05-12'),
    (8, N'Мигулина Елена Леонидовна', '1992-11-08'),
    (8, N'Шпиленя Алексей Сергеевич', '1992-03-12'),
    (9, N'Астафьев Игорь Александрович', '1995-08-10'),
    (9, N'Гайтюкевич Андрей Игоревич', '1995-05-02'),
    (9, N'Рученя Наталья Александровна', '1995-01-08'),
    (9, N'Тарасевич Анастасия Ивановна', '1995-09-11'),
    (10, N'Жоглин Николай Владимирович', '1994-01-08'),
    (10, N'Санько Андрей Дмитриевич', '1994-09-11'),
    (10, N'Пещур Анна Александровна', '1994-04-06'),
    (10, N'Бучалис Никита Леонидович', '1994-08-12'),
    (11, N'Лавренчук Владислав Николаевич', '1993-11-07'),
    (11, N'Власик Евгения Викторовна', '1993-06-04'),
    (11, N'Абрамов Денис Дмитриевич', '1993-12-10'),
    (11, N'Оленчик Сергей Николаевич', '1993-07-04'),
    (11, N'Савинко Павел Андреевич', '1993-01-08'),
    (11, N'Бакун Алексей Викторович', '1993-09-02'),
    (12, N'Бань Сергей Анатольевич', '1995-12-11'),
    (12, N'Сечейко Илья Александрович', '1995-06-10'),
    (12, N'Кузмичева Анна Андреевна', '1995-08-09'),
    (12, N'Бурко Диана Францевна', '1995-07-04'),
    (12, N'Даниленко Максим Васильевич', '1995-03-08'),
    (12, N'Зизюк Ольга Олеговна', '1995-09-12'),
    (13, N'Шарапо Мария Владимировна', '1994-10-08'),
    (13, N'Касперович Вадим Викторович', '1994-02-10'),
    (13, N'Чупрыгин Арсений Александрович', '1994-11-11'),
    (13, N'Воеводская Ольга Леонидовна', '1994-02-10'),
    (13, N'Метушевский Денис Игоревич', '1994-01-12'),
    (14, N'Ловецкая Валерия Александровна', '1993-09-11'),
    (14, N'Дворак Антонина Николаевна', '1993-12-01'),
    (14, N'Щука Татьяна Николаевна', '1993-06-09'),
    (14, N'Коблинец Александра Евгеньевна', '1993-01-05'),
    (14, N'Фомичевская Елена Эрнестовна', '1993-07-01'),
    (15, N'Бесараб Маргарита Вадимовна', '1992-04-07'),
    (15, N'Бадуро Виктория Сергеевна', '1992-12-10'),
    (15, N'Тарасенко Ольга Викторовна', '1992-05-05'),
    (15, N'Афанасенко Ольга Владимировна', '1992-01-11'),
    (15, N'Чуйкевич Ирина Дмитриевна', '1992-06-04'),
    (16, N'Брель Алеся Алексеевна', '1994-01-08'),
    (16, N'Кузнецова Анастасия Андреевна', '1994-02-07'),
    (16, N'Томина Карина Геннадьевна', '1994-06-12'),
    (16, N'Дуброва Павел Игоревич', '1994-07-03'),
    (16, N'Шпаков Виктор Андреевич', '1994-07-04'),
    (17, N'Шнейдер Анастасия Дмитриевна', '1993-11-08'),
    (17, N'Шыгина Елена Викторовна', '1993-04-02'),
    (17, N'Клюева Анна Ивановна', '1993-06-03'),
    (17, N'Доморад Марина Андреевна', '1993-11-05'),
    (17, N'Линчук Михаил Александрович', '1993-07-03'),
    (18, N'Васильева Дарья Олеговна', '1995-01-08'),
    (18, N'Щигельская Екатерина Андреевна', '1995-09-06'),
    (18, N'Сазонова Екатерина Дмитриевна', '1995-03-08'),
    (18, N'Бакунович Алина Олеговна', '1995-08-07');

create table PROGRESS
(   
    SUBJECT nchar(10) constraint PROGRESS_SUBJECT_FK foreign key
        references SUBJECT(SUBJECT),                
    IDSTUDENT integer constraint PROGRESS_IDSTUDENT_FK foreign key         
        references STUDENT(IDSTUDENT),        
    PDATE date, 
    NOTE integer check (NOTE between 1 and 10)
);

insert into PROGRESS (SUBJECT, IDSTUDENT, PDATE, NOTE) values 
    (N'ОАиП', 1001, '2013-10-01', 8),
    (N'ОАиП', 1002, '2013-10-01', 7),
    (N'ОАиП', 1003, '2013-10-01', 5),
    (N'ОАиП', 1005, '2013-10-01', 4),
    (N'СУБД', 1014, '2013-12-01', 5),
    (N'СУБД', 1015, '2013-12-01', 9),
    (N'СУБД', 1016, '2013-12-01', 5),
    (N'СУБД', 1017, '2013-12-01', 4),
    (N'КГ', 1018, '2013-05-06', 4),
    (N'КГ', 1019, '2013-05-06', 7),
    (N'КГ', 1020, '2013-05-06', 7),
    (N'КГ', 1021, '2013-05-06', 9),
    (N'КГ', 1022, '2013-05-06', 5),
    (N'КГ', 1023, '2013-05-06', 6);
