SELECT ЗАКАЗЫ.*, ЗАКАЗЫ.[Номер заказа] AS Expr1, ЗАКАЗЫ.[Наименование товара] AS Expr2, ЗАКАЗЫ.[Цена продажи] AS Expr3, ЗАКАЗЫ.Количество AS Expr4, ЗАКАЗЫ.[Дата поставки] AS Expr5, 
                  ЗАКАЗЫ.Заказчик AS Expr6
FROM     ЗАКАЗЧИКИ INNER JOIN
                  ЗАКАЗЫ ON ЗАКАЗЧИКИ.[Наимонование фирмы] = ЗАКАЗЫ.Заказчик INNER JOIN
                  ТОВАРЫ ON ЗАКАЗЫ.[Наименование товара] = ТОВАРЫ.Наименование
WHERE  (ЗАКАЗЫ.[Дата поставки] > CONVERT(DATETIME, '2024-10-10 00:00:00', 102))SELECT Наименование AS Expr1, Цена AS Expr2, ТОВАРЫ.*, Количество AS Expr3
FROM     ТОВАРЫ
WHERE  (Цена BETWEEN 4 AND 10)SELECT ЗАКАЗЧИКИ.*, [Наимонование фирмы] AS Expr1, Адрес AS Expr2, [Расчетный счет] AS Expr3
FROM     ЗАКАЗЧИКИ
WHERE  ([Наимонование фирмы] = N'Хит')SELECT DISTINCT ЗАКАЗЫ.Заказчик
FROM     ЗАКАЗЧИКИ INNER JOIN
                  ЗАКАЗЫ ON ЗАКАЗЧИКИ.[Наимонование фирмы] = ЗАКАЗЫ.Заказчик
WHERE  (ЗАКАЗЫ.[Наименование товара] = N'Молоко')