USE z_MyBase_2;
GO

INSERT INTO Виды_кредита (Код_вида, Название, Ставка)
VALUES 
(1, N'Потребительский', 14.5),
(2, N'Ипотека', 9.8),
(3, N'Автокредит', 12.0);
GO

INSERT INTO Клиенты (ID_клиента, ФИО, Паспорт)
VALUES 
(101, N'Иванов Иван Иванович', N'МС 1234567'),
(102, N'Петрова Анна Сергеевна', N'КН 7654321'),
(103, N'Сидоров Олег Петрович', N'АВ 1122334');
GO

INSERT INTO Выдача_кредитов (Номер_договора, ID_клиента, Код_вида, Сумма, Дата_выдачи)
VALUES 
(5001, 101, 1, 500000, '2024-03-24'), 
(5002, 102, 2, 3000000, '2024-03-20'), 
(5003, 101, 3, 1200000, GETDATE());    
GO
